# -*- coding: utf-8 -*-
"""
Created on Thu Feb 13 10:35:56 2025

@author: Admin
통계 분석 기법을 이용한 가설 검정
"""
'''
가설 검정이란?

통계분석 : 기술통계, 추론통계
   기술통계 : 데이터를 요약해서 설명하는 통계분석기법
      예) 월급을 집계해서 월급의 평균 구하기

   추론통계 : 어떤 값이 발생할 확률을 계산하는 통계분석기법
      예) 성별에 따라 월급차이가 있는 것으로 나타났을 때,
          이 차이가 우연히 발생할 확률을 계산.
       만약, 이 차이가 우연히 발생할 확률이 적다면, 
             성별에 따른 월급 차이가 통계적으로 유의하다 라고 결론.
  
   * 데이터를 이용하여 신뢰할 수 있는 결론을 내리려면
     유의확률을 계산하는 통계적 가설 검정 절차를 거쳐야 한다!!!
     
   통계적 가설 검정 : 유의확률을 이용하여 가설을 검정하는 방법
   
   유의확률 : 실제로는 집단(변수)간의 차이가 없는데,
             우연히 차이가 있는 데이터가 추출될 확률
     통계분석 결과,
     유의확률이 크게 나타났다면
     => 집단간의 차이가 통계적으로 유의하지 않다 
     
   통계적 가설 검정 방법 : 
       두 집단간의 평균의 차이가 있는지 검정하는 t검정
       두 집단간의 관련이 있는지 검정하는 상관분석
'''











